// Є змінна х, якій ви надаєте довільне числове значення.
//    якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
//     let x = 10
//            if (x != 1){
//                console.log("Вірно")
//            } else {
//                 console.log("Невірно")
//            }
//            if (x != 0) {
//                console.log("Вірно")
//            } else {
//                console.log("Невірно")
//            } if (x != -3){
//                console.log("Вірно")
//            } else {
//                console.log("Невірно")
// }
           // Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// в першу, другу, третю или четверту частину години).
//  let time = 10;
//         if (time <= 15){
//             console.log("Перша частина години")
//         }else if (time <= 30 ) {
//            console.log("Друга частина години")
//         }else if (time <= 45 ){
//             console.log("Третя частина години")
//         }else if (time <= 59){
//             console.log("Четверта частина години")
//         }
// У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
// let day = 20
//     if (day <= 10){
//         console.log("Перша декада")
//     }else if (day <= 20){
//         console.log("Друга декада")
//     }else if (day <= 31){
//         console.log("Третя декада")
//     }
// Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).lt
// let homeork =prompt("Який день нагадати  ?");
//     switch ( homeork ){
//         case "Понеділок":
//             console.log("Практика");
//         case "Вівторок":
//             console.log("Лекція");
//         case "Середа":
//             console.log("Практика");
//         case "Четвер":
//             console.log("Лекція");
//         case "Пятниця":
//             console.log("Засвоєння");
//         case "Субота":
//             console.log("Englund");
//         case "Неділя":
//             console.log("Бог відпочивав, і ти віпочинь!");
//     }
//     //- Користувач вводить або має два числа.
// //    Потрібно знайти та вивести максимальне число з тих двох .
// //    Також потрібно врахувати коли введені рівні числа.
//  let nub1 = +prompt("Число 1")
//  let nub2 = +prompt("Число 2")
//     if (nub1 > nub2){
//         console.log(nub1)
//     } else if (nub2 > nub1){
//         console.log(nub2)
//     }else if(nub1 = nub2){
//         console.log("Одинакове значення")
//     }
// є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
//   за допомоги  оператора || буде присвоювати змінній х значення "default"  якщо значення змінної х являється falsy (хибноподыбне, тобто кастується до false)
let x =
    console.log(typeof x)